In [1]:
import pandas as pd
import numpy as np

In [2]:
mylist = [5.4, 6.1, 1.7, 99.8]
myarray = np.array(mylist)

In [3]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [4]:
print(myseries1[2])

1.7

In [5]:
mylabels = ['first', 'second', 'third', 'fourth']
myseries3 = pd.Series(data=mylist, index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [6]:
myseries4 = pd.Series(mylist, mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [7]:
print(myseries4['second'])

6.1

In [9]:
myseries5 = pd.Series([5.5, 1.1, 8.8, 1.6], ['first', 'second', 'third', 'fourth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.5
second    1.1
third     8.8
fourth    1.6
dtype: float64

first      10.9
second      7.2
third      10.5
fourth    101.4
dtype: float64

In [10]:
df1 = pd.concat([myseries4,myseries5], axis=1, sort=False)
df1

           0    1
first    5.4  5.5
second   6.1  1.1
third    1.7  8.8
fourth  99.8  1.6

In [11]:
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  1.061543  0.206123  0.565881  0.609576 -0.590684
1 -0.445916  2.027651 -1.223067  0.332901  0.042523
2  3.640971 -1.854807  0.207649  0.449259  0.319639
3 -0.818949  1.434303 -0.771098 -0.542793  0.330401
4  0.702812  1.075816  0.114951 -0.447549  0.229653

In [12]:
df3 = pd.DataFrame(np.random.randn(5,5), index=['1st', '2nd', '3rd', '4th', '5th'],
                  columns=['first', 'second', 'third', 'fourth', 'fifth'])
df3

        first    second     third    fourth     fifth
1st -0.280111  0.914968  0.124350  0.568851  1.599940
2nd -0.496514 -0.898418 -1.650354 -2.302325  0.265371
3rd -1.789298  0.560068  0.038386 -0.175425  0.209264
4th -2.354180 -0.651894 -0.011244  0.639380  0.340092
5th  0.366112  1.182767  1.168637 -0.754562  0.164540

In [13]:
print(df3['second'])
print('')
df3[['third', 'first']]

1st    0.914968
2nd   -0.898418
3rd    0.560068
4th   -0.651894
5th    1.182767
Name: second, dtype: float64

        third     first
1st  0.124350 -0.280111
2nd -1.650354 -0.496514
3rd  0.038386 -1.789298
4th -0.011244 -2.354180
5th  1.168637  0.366112